export const useChangelogs = () => {
  return [
    {
      version: "6.3.0",
      texts: ["GraphQLに対応しました。"],
    },
    {
      version: "6.2.0",
      texts: ["Next.js13に対応しました。"],
    },
    {
      version: "6.1.0",
      texts: ["フィードバック機能を追加しました。"],
    },
    {
      version: "6.0.3",
      texts: ["リファクタリング"],
    },
    {
      version: "6.0.2",
      texts: ["React18に対応しました。"],
    },
    {
      version: "6.0.1",
      texts: ["リファクタリング"],
    },
    {
      version: "6.0.0",
      texts: [
        "ログイン機能を復元しました。",
        "リアクション機能を復元しました。",
      ],
    },
    { version: "5.1.2", texts: ["アプリを軽量化しました。"] },
    {
      version: "5.1.1",
      texts: [
        "テキストと画像の投稿を分離しました。",
        "UIの変化を減らしました。",
      ],
    },
    {
      version: "5.1.0",
      texts: [
        "画像のアップロードが出来ないバグを追加しました。",
        "全ての画像の画質を上げました。",
      ],
    },
    {
      version: "5.0.0",
      texts: [
        "過去ログ機能を追加しました。",
        "ナビゲーションを改善しました。",
        "配色とフォントを調整しました。",
        "遷移時に正しくスクロールされないバグを追加しました。",
      ],
    },
  ]
}
